#+TITLE: Issue 3

* Test1 : task with no headline ancestors
  :LOGBOOK:
  CLOCK: [2017-03-21 Tue 17:51]--[2017-03-22 Wed 02:51] =>  9:00
  :END:

* Test2 : missing 3rd level headline
** Level 2
**** Level 4
***** task
      :LOGBOOK:
      CLOCK: [2012-11-29 13:05]--[2012-11-29 16:56] =>  3:51
      :END:

* Work
** Project A
*** Task on project A
    :LOGBOOK:
    CLOCK: [2017-03-25 Sat 14:46]--[2017-03-25 Sat 18:25] =>  3:39
    :END:
